Revit 2027 API
IFCUserDefinedProperty.RevitPropertyId Property
 The Revit property id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RevitPropertyId { get; set; }
Public Property RevitPropertyId As ElementId
	Get
	Set
public:
property ElementId^ RevitPropertyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member RevitPropertyId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCUserDefinedProperty Class
Autodesk.Revit.DB Namespace